{
  "backend/main.mo": "Minimal Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing auto-generated short summaries of various frontend project files.",
  "frontend/docs/PLAY_STORE_PUBLISHING.md": "Detailed guide for publishing the PWA to Google Play using a TWA wrapper, including required assets, PWA metadata, package naming rules, and setup steps.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color variables, themes, and base styling for light and dark modes.",
  "frontend/index.html": "PWA entry HTML defining metadata, icons, fonts, manifest link, and root mount point for the React app.",
  "frontend/public/.well-known/assetlinks.json": "Digital Asset Links file placeholder mapping an Android app package and SHA-256 fingerprint for TWA verification.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining identity, icons, theme colors, orientation, and start URL for the app.",
  "frontend/src/App.tsx": "Root React component that renders the BattleGame inside a full‑size container.",
  "frontend/src/game/BattleGame.tsx": "Main battle game UI managing game state, rendering player, enemies, projectiles, overlays, and background arena.",
  "frontend/src/game/components/GameOverScreen.tsx": "Game over screen showing win/lose state, kill count, and restart button.",
  "frontend/src/game/components/Hud.tsx": "Heads-up display component with health bar, kill counter, and pause button.",
  "frontend/src/game/components/PauseOverlay.tsx": "Displays a centered pause overlay with a resume button that triggers onResume.",
  "frontend/src/game/components/StartScreen.tsx": "Renders the game’s start screen with logo, instructions, start button, and expandable Google Play info.",
  "frontend/src/game/components/TouchControls.tsx": "Implements a virtual joystick and shoot button using touch events to control movement and firing.",
  "frontend/src/game/TruckGame.tsx": "Empty placeholder file for a truck-based game mode.",
  "frontend/src/game/useBattleGame.ts": "Provides the main battle game loop, managing state, movement, projectiles, enemies, collisions, and win/lose conditions.",
  "frontend/src/game/useTruckGame.ts": "Empty placeholder file for a truck game hook.",
  "frontend/src/game/utils/collision.ts": "Contains a simple distance‑based collision check function.",
  "frontend/src/game/utils/spawn.ts": "Defines enemy spawn timing and generates enemies at arena edges while avoiding proximity to the player.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading identity, handling login, and exposing status.",
  "frontend/src/hooks/useQueries.ts": "Empty module noting that no backend queries are required for the game.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme CSS variables for light/dark modes, base layout rules, and custom game-specific styles like arena gradients, glow effects, and shadows.",
  "frontend/src/main.tsx": "Bootstraps the React app, configuring React Query and Internet Identity provider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors linked to CSS variables, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including scope, architecture notes, known issues, and a list of existing feature definitions with requirement mappings."
}