{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "JSON report listing implemented features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file summarizing the purpose of all frontend files for quick reference.",
  "frontend/docs/PLAY_STORE_PUBLISHING.md": "Step-by-step guide for packaging and publishing the PWA to Google Play using a TWA wrapper.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH theme variables and base styles for light and dark modes.",
  "frontend/index.html": "HTML entrypoint including PWA metadata, icons, manifest link, and root mount point.",
  "frontend/public/manifest.webmanifest": "Web app manifest defining PWA metadata, start URL, colors, orientation, and app icons.",
  "frontend/src/App.tsx": "Root React component rendering the TruckGame inside a full-size container.",
  "frontend/src/game/components/GameOverScreen.tsx": "Game over overlay displaying the final score and a restart button.",
  "frontend/src/game/components/Hud.tsx": "Top HUD showing current score and a pause button during gameplay.",
  "frontend/src/game/components/PauseOverlay.tsx": "Pause screen overlay providing a resume button and preventing interaction with the game.",
  "frontend/src/game/components/StartScreen.tsx": "Start screen UI with game title, instructions, start button, and expandable Google Play publishing info.",
  "frontend/src/game/components/TouchControls.tsx": "Renders left and right on-screen buttons for lane movement with click and touch handlers.",
  "frontend/src/game/TruckGame.tsx": "Main game UI component coordinating gameplay state, rendering road, truck, obstacles, and managing overlays.",
  "frontend/src/game/useTruckGame.ts": "Main game state hook handling movement, obstacle spawning, scoring, collisions, and the game loop.",
  "frontend/src/game/utils/collision.ts": "Collision detection utility comparing truck lane and vertical position with obstacles.",
  "frontend/src/game/utils/spawn.ts": "Obstacle spawning utilities deciding when to spawn and selecting a lane for new obstacles.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity initialization via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder since the game uses only client-side state.",
  "frontend/src/index.css": "Tailwind setup defining light/dark road-themed colors and game-specific styles like road stripes and overlays.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the app.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom colors, typography, animations, and plugin extensions for container queries and animations.",
  "project_state.json": "Project metadata describing an Android-targeted truck web game, including architecture notes, known issues, required images, and a list of implemented features."
}