{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "TWA/Play Store readiness: Digital Asset Links, Bubblewrap packaging docs, and PWA metadata consistency",
  "requirements": [
    {
      "id": "REQ-21",
      "summary": "Add Digital Asset Links verification file for TWA by serving a static /.well-known/assetlinks.json from public assets.",
      "acceptanceCriteria": [
        "A new file exists at `frontend/public/.well-known/assetlinks.json`.",
        "The file uses valid Digital Asset Links JSON structure (an array of objects with `relation` and `target`).",
        "The `assetlinks.json` content is clearly marked/documented as requiring the developer’s real Android package name and SHA-256 cert fingerprint before Play Store submission.",
        "When the app is deployed, `https://<domain>/.well-known/assetlinks.json` is accessible and returns the JSON file."
      ],
      "file_operations": [
        {
          "path": "frontend/public/.well-known/assetlinks.json",
          "operation": "create",
          "description": "Create a valid Digital Asset Links JSON array granting TWA handling to an Android app, using clearly labeled placeholder values for `package_name` and `sha256_cert_fingerprints` that must be replaced with the real Android package name and SHA-256 signing cert fingerprint before Play Store submission."
        },
        {
          "path": "frontend/docs/PLAY_STORE_PUBLISHING.md",
          "operation": "modify",
          "description": "Document how `/.well-known/assetlinks.json` is served from `frontend/public/.well-known/assetlinks.json`, and add guidance for updating the placeholders with the real package name and SHA-256 fingerprint and verifying the URL is publicly reachable over HTTPS."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Expand Play Store publishing documentation with a complete Bubblewrap (TWA) release AAB flow and targeted troubleshooting for the \"Unable to create your app\" packaging failure.",
      "acceptanceCriteria": [
        "`frontend/docs/PLAY_STORE_PUBLISHING.md` contains complete Bubblewrap command examples (install, init, build) with placeholders for package name, host URL, and signing info.",
        "The markdown renders correctly (no broken/unclosed code fences) and includes steps for creating a keystore and producing a signed AAB for Play Console upload.",
        "The doc includes a troubleshooting section that explicitly references and addresses the error string: `Unable to create your app` (common causes and what to check).",
        "The doc includes a short checklist verifying the deployed PWA requirements used by TWA: HTTPS, valid manifest URL, icons reachable, and `/.well-known/assetlinks.json` reachable."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/PLAY_STORE_PUBLISHING.md",
          "operation": "modify",
          "description": "Rewrite/complete the guide to include an end-to-end, copy/paste-ready Bubblewrap flow (install, init, build) with placeholders for host URL, applicationId/package name, and signing configuration; add keystore creation + signed release AAB production steps; add a troubleshooting section explicitly referencing the exact error string `Unable to create your app` with common causes (unreachable manifest/icons, HTTP/redirect issues, asset links mismatch, incorrect package/fingerprint) and checks; ensure all code fences are closed and all added/edited text is in English."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Align and document the exact PWA metadata values used for TWA setup (manifest + HTML consistency and copy/paste-ready values).",
      "acceptanceCriteria": [
        "`frontend/public/manifest.webmanifest` and `frontend/index.html` are consistent for app name/description/theme color and icon references (no mismatched filenames/paths).",
        "The Play Store publishing doc lists the exact current PWA values (App ID `skylance-royale`, manifest path `/manifest.webmanifest`, icon paths under `/assets/generated/...`) so they can be copied into Bubblewrap/Android Studio without guesswork.",
        "All user-facing text added/edited by this change is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update HTML metadata to be internally consistent with `frontend/public/manifest.webmanifest` (e.g., align the document title/app name text and confirm theme color/description/icon link paths match the manifest references)."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "modify",
          "description": "Verify and, if needed, adjust manifest fields so they remain consistent with `frontend/index.html` (app name/description/theme color and icon paths), without changing the established App ID `skylance-royale` unless explicitly required by the BuildRequest."
        },
        {
          "path": "frontend/docs/PLAY_STORE_PUBLISHING.md",
          "operation": "modify",
          "description": "Add a dedicated section listing the exact current PWA values to copy into Bubblewrap/TWA setup (App name, App ID `skylance-royale`, `start_url` value, manifest URL `/manifest.webmanifest`, and icon URLs pointing to `frontend/public/assets/generated/battle-app-icon-small.dim_192x192.png` and `frontend/public/assets/generated/battle-app-icon.dim_512x512.png`), and keep all added/edited user-facing text in English."
        }
      ]
    }
  ]
}